// Завдання 1:
// Написати розв’язок нижче описаного завдання (по одному рядку коду на кожний пункт)
// — Створіть змінну city з типом даних string.
// — Присвойте їй значення «Київ».
// — Змініть значення змінної city на «Львів».
// — Створіть змінну address з типом даних string і скопіюйте в неї значення змінної city.
// — Вивести значення змінної address з допомогою команди console.log().

let city: string = "Київ";
    city = "Львів";
let  address:string = city;   
 console.log(address);
  





